#폴리오미노 1*1 정사각형 여러개 이어서 붙인 도형
# 정사각형은 서로 겹치면 안됨
# 도형은 모두 연결
# 정사각형의 변끼리 연결되어 함, 꼭짓점과 꼭짓점만 맞닿아 있으면 안됨
# 정사각형 4개를 이어 붙인 폴리오미노는 테트로미노
#N*M 테트로미노 하나를 놓으려고 함
# 칸에는 정수가 있고 테트로미노가 놓인 칸에 쓰여 있는 수들의 합을 최대로 함
# 회전,대칭가능
N,M = map(int,input().split())
matrix = []
for i in range(N):
    matrix.append(list(map(int, input().split())))

#모양구현해보기
shape = [
    # -
    [[0,0],[0,1],[0,2],[0,3]],
    [[0,0],[1,0],[2,0],[3,0]],
    # ㅁ
    [[0,0],[1,0],[0,1],[1,1]],
    # ㄴ
    [[0,0],[1,0],[2,0],[2,1]],
    [[0,0],[0,1],[-1,1],[-2,1]],
    [[0,0],[1,0],[2,0],[0,1]],
    [[0,0],[0,1],[1,1],[2,1]],
    [[0,0],[1,0],[1,1],[1,2]],
    [[0,0],[0,1],[0,2],[-1,2]],
    [[0,0],[1,0],[0,1],[0,2]],
    [[0,0],[0,1],[0,2],[1,2]],
    # ㅓ
    [[0, 0], [0, 1], [0, 2], [-1, 1]],
    [[0, 0], [0, 1], [0, 2], [1, 1]],
    [[0, 0], [0, 1], [-1, 1], [1, 1]],
    [[0, 0], [1, 0], [2, 0], [1, 1]],
    # ㄹ
    [[0, 0], [1, 0], [1, 1], [2, 1]],
    [[0, 0], [0, 1], [-1, 1], [-1, 2]],
    [[0, 0], [1, 0], [0, 1], [-1, 1]],
    [[0, 0], [0, 1], [1, 1], [1, 2]]
]

def solution(x,y):
    global result
    for i in range(19):
        tmp = 0
        for j in range(4):
            nx = x + shape[i][j][0]
            ny = y + shape[i][j][1]
            if nx<0 or nx>=N or ny<0 or ny>=M:
                break
            tmp += matrix[nx][ny]
        result = max(result, tmp)
result = 0
for i in range(N):
    for j in range(M):
        solution(i,j)
print(result)


